app/views/home/index.html.erb

                    <div id="notice_likes_<%= n.id %>">
                      <% if n.post_likes.where(:user_id => current_user.id).size > 0 %>
                        <button type="button" class="btn btn-outline btn-sm" onclick="noticeAction('unlike',<%= n.id %>)"><i class="fas fa-heart" style="color: red"></i>&nbsp;&nbsp;<%= n.post_likes.size %></button>
                      <% else %>
                        <button type="button" class="btn btn-outline btn-sm" onclick="noticeAction('like',<%= n.id %>)"><i class="far fa-heart" style="color: red"></i>&nbsp;&nbsp;<%= n.post_likes.size %></button>
---
SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`user_id` = 1
SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`notice_id` = 1

                    <div id="notice_comments_<%= n.id %>">
                      <% if n.notice_comments.where(:user_id => current_user.id).size > 0 %>
                        <button type="button" class="btn btn-outline btn-sm" onclick="noticeAction('comment',<%= n.id %>)"><i class="fas fa-comments" style="color: purple"></i>&nbsp;&nbsp;<%= n.notice_comments.size %></button>
                      <% else %>
                        <button type="button" class="btn btn-outline btn-sm" onclick="noticeAction('comment',<%= n.id %>)"><i class="far fa-comments" style="color: purple"></i>&nbsp;&nbsp;<%= n.notice_comments.size %></button>
---
SELECT COUNT(*) FROM `notice_comments` WHERE `notice_comments`.`notice_id` = 1 AND `notice_comments`.`user_id` = 1
SELECT COUNT(*) FROM `notice_comments` WHERE `notice_comments`.`notice_id` = 1

            <div class="dropdown-divider"></div>
            <small class="card-text" id="liked_records"><i class="fas fa-heart" style="color: coral"></i>&nbsp;&nbsp;<a href="/?filter=liked">Liked Records</a> - <%= PostLike.where(:user_id => current_user.id).size %></small><br>
            <small class="card-text" id="commented_records"><i class="fas fa-comment" style="color: purple"></i>&nbsp;&nbsp;<a href="/?filter=commented">Commented Records</a> - <%= NoticeComment.where(:user_id => current_user.id).select(:notice_id).distinct.size %></small><br>
---
SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`user_id` = 1
SELECT COUNT(*) FROM (SELECT DISTINCT `notice_comments`.`notice_id` FROM `notice_comments` WHERE `notice_comments`.`user_id` = 1) subquery_for_count