app/views/home/notice_details.html.erb

    <div class="card border-danger mb-3">
      <div class="card-header"><i class="fas fa-heart" style="color: coral"></i>&nbsp;&nbsp;Likes (<%= @nObj.post_likes.size %>)</div>
      <div class="card-body text-danger" style="min-height: 500px;max-height: 500px;overflow: scroll">
        <% @nObj.post_likes.each do |pl| %>
          <div class="alert alert-light" style="border: solid 1px;margin-bottom: 10px">
            <i class="fas fa-user" style="color: sienna"></i>&nbsp;&nbsp;<%= pl.user.first_name + ' ' + pl.user.last_name %>
---
SELECT `post_likes`.* FROM `post_likes` WHERE `post_likes`.`notice_id` = 1
SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`notice_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    <div class="card border-info mb-3">
      <div class="card-header"><i class="fas fa-comment" style="color: purple"></i>&nbsp;&nbsp;Comments (<%= @nObj.notice_comments.size %>)</div>
      <div class="card-body" style="min-height: 500px;max-height: 500px;overflow: scroll">
        <% @nObj.notice_comments.each do |nc| %>
---
SELECT `notice_comments`.* FROM `notice_comments` WHERE `notice_comments`.`notice_id` = 1
SELECT COUNT(*) FROM `notice_comments` WHERE `notice_comments`.`notice_id` = 1

                  <div class="col-md-6">
                    <small class="text-muted"><i class="fas fa-user" style="color: orange"></i>&nbsp;&nbsp;<%= nc.user.first_name + ' ' + nc.user.last_name %></small>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]