app/controllers/admin_controller.rb

  def new_notice
    if request.post?
      nn = Notice.new(notice_params)
      if nn.published
        nn.published_at = DateTime.now
      end
      unless nn.save
---
INSERT INTO `notices` (`content`, `published`, `published_at`, `created_at`, `updated_at`, `is_public`) VALUES ('hii', TRUE, '2021-09-18 16:06:08', '2021-09-18 16:06:09.024914', '2021-09-18 16:06:09.024914', TRUE)

  def delete_notice
    n_obj = Notice.find_by(:id => params[:notice_id])
    if n_obj
      unless n_obj.destroy
---
SELECT `notices`.* FROM `notices` WHERE `notices`.`id` = 1 LIMIT 1
DELETE FROM `notices` WHERE `notices`.`id` = 1

  def edit_notice
    @nObj = Notice.find_by(:id => params[:notice_id])
    if @nObj
      if request.post?
        if !@nObj.published? && notice_params[:published]
          @nObj.published_at = DateTime.now
        end
        unless @nObj.update(notice_params)
---
SELECT `notices`.* FROM `notices` WHERE `notices`.`id` = 1 LIMIT 1
UPDATE `notices` SET `notices`.`content` = 'hii <b>hello</b>', `notices`.`is_public` = FALSE, `notices`.`updated_at` = '2021-09-19 09:53:48.600595' WHERE `notices`.`id` = 10

  def get_user_listing
    begin
      d_listing_columns = %w[id first_name last_name email department semester is_admin is_verified created_at updated_at].freeze
      users = User.datatable_filter(params['search']['value'], params['columns'])
      users = users.datatable_order(params['order']['0']['column'].to_i, params['order']['0']['dir'])
      users = users.select(d_listing_columns).page(params['start'].to_i + 1).per(params['length'])
      users_filtered = users.count
      render json: { data: users, draw: params['draw'].to_i, recordsTotal: User.count, recordsFiltered: users_filtered}
---
SELECT COUNT(count_column) FROM (SELECT id, first_name, last_name, email, department, semester, is_admin, is_verified, created_at, updated_at AS count_column FROM `users` ORDER BY id asc LIMIT 10 OFFSET 0) subquery_for_count
SELECT COUNT(*) FROM `users`

  def get_notice_listing
    begin
      d_listing_columns = %w[id content published published_at is_public created_at updated_at].freeze
      notices = Notice.datatable_filter(params['search']['value'], params['columns'])
      notices = notices.datatable_order(params['order']['0']['column'].to_i, params['order']['0']['dir'])
      notices = notices.select(d_listing_columns).page(params['start'].to_i + 1).per(params['length'])
      notices_filtered = notices.count
      render json: { data: notices, draw: params['draw'].to_i, recordsTotal: Notice.count, recordsFiltered: notices_filtered}
---
SELECT COUNT(count_column) FROM (SELECT id, content, published, published_at, is_public, created_at, updated_at AS count_column FROM `notices` ORDER BY id asc LIMIT 10 OFFSET 0) subquery_for_count
SELECT COUNT(*) FROM `notices`

  def update_user
    user = User.find_by(:id => params[:uId])
    if user
      case params[:act]
      when 'enable'
        user.is_verified = true
      when 'disable'
        user.is_verified = false
      else
        render json: {msg: 'Invalid action'}, status: 500
      end

      unless user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `users`.`is_verified` = FALSE, `users`.`updated_at` = '2021-09-18 16:08:58.268356' WHERE `users`.`id` = 2