app/controllers/home_controller.rb

  def index
    if user_signed_in?
      filtered = false
      if params[:filter] && params[:filter] == 'liked'
        filtered = true
        @notices = Notice.joins(:post_likes).where(post_likes: {:user_id => current_user.id},:published => true).order(published_at: :desc)
      elsif params[:filter] && params[:filter] == 'public'
        filtered = true
        @notices = Notice.where(:is_public => true, :published => true).order(published_at: :desc)
      elsif params[:filter] && params[:filter] == 'commented'
        filtered = true
        @notices = Notice.joins(:notice_comments).where(notice_comments: {:user_id => current_user.id}, :published => true).distinct(:notice).order(published_at: :desc)
      else
        @notices = Notice.where(:published => true).order(published_at: :desc)
---
SELECT `notices`.* FROM `notices` WHERE `notices`.`is_public` = TRUE AND `notices`.`published` = TRUE ORDER BY `notices`.`published_at` DESC
SELECT `notices`.* FROM `notices` WHERE `notices`.`published` = TRUE ORDER BY `notices`.`published_at` DESC

  def notice_action
    nObj = Notice.find_by(:id => params[:notice_id])
    if nObj
      if params[:n_action] == 'like'
        unless nObj.post_likes.where(:user_id => current_user.id).size > 0
          nObj.post_likes.create(:user_id => current_user.id)
        end
      end
      if params[:n_action] == 'unlike'
        unless nObj.post_likes.where(:user_id => current_user.id).size == 0
          PostLike.delete(nObj.post_likes.where(:user_id => current_user.id).first.id)
        end
      end
      if params[:n_action] == 'comment_create'
        if params[:comment_text] != ""
          nObj.notice_comments.create(:user_id => current_user.id, :comment => params[:comment_text])
        else
          render json: {msg: 'Comment cannot be empty'}, status: 400
        end
      end
      render json: {
        msg: 'Success',
        total_likes: nObj.post_likes.size,
        total_comments: nObj.notice_comments.size,
        commented_notices: NoticeComment.where(:user_id => current_user.id).select(:notice_id).distinct.size,
        liked_records: PostLike.where(:user_id => current_user.id).size
---
SELECT `notices`.* FROM `notices` WHERE `notices`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`notice_id` = 1 AND `post_likes`.`user_id` = 1
INSERT INTO `post_likes` (`notice_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-05-30 15:55:15.057708', '2021-05-30 15:55:15.057708')
INSERT INTO `notice_comments` (`comment`, `user_id`, `notice_id`, `created_at`, `updated_at`) VALUES ('wow', 1, 1, '2021-05-30 15:55:23.197189', '2021-05-30 15:55:23.197189')
SELECT COUNT(*) FROM (SELECT DISTINCT `notice_comments`.`notice_id` FROM `notice_comments` WHERE `notice_comments`.`user_id` = 1) subquery_for_count
SELECT COUNT(*) FROM `post_likes` WHERE `post_likes`.`user_id` = 1

  def notice_details
    @nObj = Notice.find_by(:id => params[:notice_id])
---
SELECT `notices`.* FROM `notices` WHERE `notices`.`id` = 1 LIMIT 1