app/controllers/users/sessions_controller.rb

  def create
    # super
    uObj = User.where(:email => sign_in_params[:email])
    if uObj.size > 0 && uObj.first.is_verified?
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'sivaroop080@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `users` WHERE `users`.`email` = 'sivaroop080@gmail.com'